<!DOCTYPE html
  PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
   <head>
      <meta http-equiv="Content-Type" content="text/html; charset=UTF-8"></meta>
      <title>
         [EN] How to address CaRE D1 profile ? - [FR] Comment aborder le profil CaRE D1 ?
      </title>
      <link href="Content/bootstrap.min.css" rel="stylesheet"></link>
</head>
   <body>
     
<h2>[FR]&nbsp;Aborder l'interop&eacute;rabilit&eacute; pour le programme CaRE D1</h2>
<p>Si vous &ecirc;tes un industriel, prestataire en cybers&eacute;curit&eacute;, cette page vous fournira les &eacute;l&eacute;ments et &eacute;tapes cl&eacute;s pour &ecirc;tre embarqu&eacute; dans le programme sous l'angle de l'interop&eacute;rabilit&eacute;.</p>
<h3>Etape 1 : Conna&icirc;tre le programme CaRE D1&nbsp;</h3>
<p>Consultez <a href="https://esante.gouv.fr/strategie-nationale/cybersecurite" target="_blank" rel="noopener">le site de l'Agence du Num&eacute;rique en Sant&eacute; (ANS) introduisant les quatre axes du programme national</a></p>
<h3>Etape 2 : Conna&icirc;tre le dispositif OPSSIES</h3>
<p>Regardez <a href="https://opssies.github.io/v013/introduction_opssies_bi_2.html" target="_blank" rel="noopener">la vid&eacute;o introduisant le dispositif OPSSIES et les enjeux du chantier d'interop&eacute;rabilit&eacute;</a></p>
<h3>Etape 3 : Pr&eacute;parer l'embarquement de votre structure</h3>
<p>Contactez l'ANS et suivez les instructions fournies par email par l'&eacute;quipe CaRE/Industriels. Cette &eacute;tape n'est pas d&eacute;taillable par le pr&eacute;sent canal.</p>
<h3>Etape 4 : Confirmer l'embarquement sur le volet Communication</h3>
<p><h4>4.1 T&eacute;l&eacute;chargez <a href="https://opssies.github.io/v013/ng-msp-opssies-instance-care_d1-v13.json" target="_blank" rel="noopener">l'instance illustrative CaRE D1</a></p></h4>
<p>Voici quelques points d'attention g&eacute;n&eacute;raux :</p>
<ul>
<li>pour CaRE D1, ne pas utiliser le sch&eacute;ma g&eacute;n&eacute;ral, mais valoriser l'instance illustrative CaRE D1</li>
<li>ne pas alt&eacute;rer la syntaxe, la d&eacute;signation des objets, attributs au format json ainsi que les qualifiants</li>
<li>pr&eacute;server les deux signes <em>underscore</em>&nbsp;("__") pr&eacute;fixant les attributs <em>text</em></li>
<li>pr&eacute;server les listes introduites par les crochets</li>
<li>consulter la <a href="https://opssies.github.io/v013/faq-care-d1.html" target="_blank" rel="noopener">FAQ</a>&nbsp;d&eacute;di&eacute;e au profil CaRE D1 pour la composition des relev&eacute;s d'audits</li>
</ul>
<p><h4>4.2 A l'aide d'un &eacute;diteur de texte brut ou de code (tel que Notepad++ ou Textpad), modifiez l'instance t&eacute;l&eacute;charg&eacute;e en suivant pr&eacute;cis&eacute;ment les instructions ci-dessous. Sous l'objet <em>events</em>,&nbsp;modifiez le bloc d'identification de la structure r&eacute;alisant les audits d'exposition Internet (en pratique, le bloc indiquant votre structure), en indiquant son SIREN et ses raisons sociales longue et abr&eacute;g&eacute;e.</p></h4>
<p>
  <code>   
 {<br /> "events": {<br /> "stakeholders": [<br /> {<br /> "stakeholderId": {<br /> "stakeholderIdType": 4,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_SIREN</span>"<br /> },<br /> "stakeholderNameTypes": [<br /> {<br /> "stakeholderNameType": 1,<br /> "__text": "<span style="color: #339966;">specifiez_ici_la_raison_sociale_abregee</span>"<br /> },<br /> {<br /> "stakeholderNameType": 2,<br /> "__text": "<span style="color: #339966;">specifiez_ici_la_raison_sociale_complete</span>"<br /> }<br /> ],<br /> "stakeholderType": 3,<br /> "stakeholderRoleType": 2<br /> },</p>
 </code>
<p><h4>4.3 D&eacute;posez l'instance JSON ainsi modifi&eacute;e (rappel de la convention de nommage du fichier : <i>SOCIETE-D1-AAAAMMJJ-HHMMSS.json</i>) sur la bo&icirc;te configur&eacute;e pour votre structure par la DNUM. Signalez ensuite &agrave; la DNUM que vous avez effectu&eacute; un d&eacute;p&ocirc;t d'instance de test.</p></h4>
<p><h4>4.4 Attendez le retour du MSP (DNUM et DNS) pour poursuivre les op&eacute;rations sur le volet S&eacute;mantique du relev&eacute; d'audit.</p></h4>
<h3>Etape 5 : Confirmer l'embarquement sur le volet S&eacute;mantique</h3>
<p><h4>5.1 Sur la base de l'instance de test modifi&eacute;e et valid&eacute;e par le MSP (DNUM et DNS), sous l'objet <em>events</em>, modifiez le bloc d'identification de la structure commanditaire des audits, applicable &agrave; l'ensemble des &eacute;v&eacute;nements d'audits (<em>event</em>)</p></h4>
<p>Il peut s'agir ou bien d'un groupement ou bien d'un &eacute;tablissement de sant&eacute; autonome.</p>
<p><code></code></p>
<p>Dans le cas d'un groupement (ex. : GHT), utilisez le code suivant (en modifiant les identifiants et raisons sociales) :</p>
<p><code>
<p>{<br /> "stakeholderId": {<br /> "stakeholderIdType": 3,<br /> "__text": "<span style="color: #339966;">TST-00</span>"<br /> },<br /> "stakeholderNameTypes": [<br /> {<br /> "stakeholderNameType": 6,<br /> "__text": "<span style="color: #339966;">GHT TEST</span>"<br /> },<br /> {<br /> "stakeholderNameType": 2,<br /> "__text": "<span style="color: #339966;">GROUPEMENT HOSPITALIER DE TERRITOIRE TEST</span>"<br /> }<br /> ],<br /> "stakeholderType": 2,<br /> "stakeholderRoleType": 1<br /> }</p>
<p></code>
<p>Dans le cas d'&eacute;tablissement autonome, utilisez le code suivant&nbsp;(en modifiant les identifiants et raisons sociales) :</p>
<code>
<p>{<br /> "stakeholderId": {<br /> "stakeholderIdType": 3,<br /> "__text": "<span style="color: #339966;">000000001</span>"<br /> },<br /> "stakeholderNameTypes": [<br /> {<br /> "stakeholderNameType": 1,<br /> "__text": "<span style="color: #339966;">CH TEST</span>"<br /> },<br /> {<br /> "stakeholderNameType": 2,<br /> "__text": "<span style="color: #339966;">CENTRE HOSPITALIER TEST</span>"<br /> }<br /> ],<br /> "stakeholderType": 2,<br /> "stakeholderRoleType": 1<br /> }</p>
</code></p>
<p><h4>5.2 Sous l'objet <em>event</em>, modifiez le bloc d'identification de la structure audit&eacute;e et maximisez-en l'identification, afin de faciliter, en aval de la t&eacute;l&eacute;transmission du relev&eacute;, l'association de la prestation d'audit et de la structure audit&eacute;e.</p><b>Note importante :</b> un rôle donné ne peut pas être attribué à plus d'un acteur dans un élément <i>event</i>. Par exemple, sous <i>event</i>, il ne peut pas y avoir plusieurs acteurs dont le rôle est introduit par le code 4, mais un seul (en pratique, une structure auditée).</h4>
<p><code>
<p>"event": [<br /> {<br /> "stakeholders": [<br /> {<br /> "stakeholderId": [<br /> {<br /> "stakeholderIdType": 3,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_finess_juridique</span>"<br /> },</p>
<p>{<br /> "stakeholderIdType": 6,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_trigramme_ght_si_applicable</span>"<br /> },</p>
<p>{<br /> "stakeholderIdType": 2,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_finess_geographique</span>"<br /> },</p>
<p>{<br /> "stakeholderIdType": 4,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_siren_si_disponible</span>"<br /> },</p>
<p>{<br /> "stakeholderIdType": 5,<br /> "__text": "<span style="color: #339966;">specifiez_ici_le_siret_si_disponible</span>"<br /> },<br /> ],<br /> "stakeholderNameTypes": [<br /> {<br /> "stakeholderNameType": 1,<br /> "__text": "<span style="color: #339966;">HOPITAL TEST</span>"<br /> },<br /> {<br /> "stakeholderNameType": 2,<br /> "__text": "<span style="color: #339966;">HOPITAL UNIVERSITAIRE TEST</span>"<br /> }<br /> ],<br /> "stakeholderType": <span style="color: #339966;">specifiez_ici_code_1_si_ES_code_2_si_GHT</span>,<br /> "stakeholderRoleType": 4<br /> }<br /> ],</p>
</code></p>
<p><h4>5.3 Sous l'objet <em>event</em>, modifiez le bloc dates, en pr&eacute;cisant une seule date, celle correspondant &agrave; la r&eacute;alisation effective de l'audit. Il est ici recommand&eacute; de retenir l'horodatage associ&eacute; &agrave; l'ach&egrave;vement technique de l'audit (fin du scan) et non celui associ&eacute; &agrave; son initialisation.</p></h4>
<p>Rappel important : pr&eacute;servez la liste, m&ecirc;me si une seule date est retenue ici.</p>
<p><code>
<p>"dates": [<br /> {<br /> "dateType": 7,<br /> "__text": "<span style="color: #339966;">specifiez_ici_la_date_de_realisation_de_l_audit_au_format_AAAAMMJJ-HHMMSS</span>"<br /> }<br /> ],</p>
</code>
<p><h4>5.4 Sous l'objet <em>event</em>, et sous l'objet <em>scopes</em>, modifiez les blocs de description des actifs audit&eacute;s.&nbsp;</p></h4>
<p>Rappel important : les contextes fonctionnels et techniques sont exclusivement &agrave; renseigner sous l'objet <em>scopes</em>, et non &agrave; la racine <em>event</em> pour le profil CaRE D1. La description des actifs est recommand&eacute;e par l'Agence du Num&eacute;rique en Sant&eacute;, en particulier les adresses IP et les domaines.</p>
<p><h4>5.5 Sous l'objet <em>event</em>, pr&eacute;cisez le niveau d'appr&eacute;ciation (attribut <em>level</em>) selon les r&egrave;gles &eacute;tablies par le CERT-Sant&eacute;.</p></h4>
<code>
  <p>"outcome": {<br /> "level": <span style="color: #339966;">x</span><br /> },</p>
</code>
<p><h4>5.6 Pr&eacute;servez les qualifiants d&eacute;crivant finalement l'&eacute;v&eacute;nement :</p></h4>
  <code>
<p>"tlp": "amber",<br /> "eventAnalysisType": 5,<br /> "eventType": 29</p>
    </code>
<p>Note : vous retrouverez l'ensemble des qualifiants et sc&eacute;narii des croisement des qualifiants dans la section "D&eacute;finitions" de la documentation du sch&eacute;ma d'int&eacute;rop&eacute;rabilit&eacute;. N'h&eacute;sitez pas &agrave; consulter la <a href="https://opssies.github.io/v013/faq-care-d1.html" target="_blank" rel="noopener">FAQ du profil CaRE D1</a>, r&eacute;guli&egrave;rement enrichie.</p>
<p><h4>5.7 D&eacute;posez l'instance JSON ainsi modifi&eacute;e sur la bo&icirc;te configur&eacute;e pour votre structure par la DNUM. Signalez ensuite &agrave; la DNUM que vous avez effectu&eacute; un d&eacute;p&ocirc;t d'instance avec des donn&eacute;es de production.</p></h4>
<p><h4>5.8 Attendez le retour du MSP (DNUM et DNS) pour basculer d&eacute;finitivement en mode production, et communiquer officiellement sur votre service de t&eacute;l&eacute;transmission de relev&eacute;s CaRE D1 aupr&egrave;s de vos partenaires hospitaliers.</p></h4>
<p>&nbsp;</p>
       
     </body>
</html>
